---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolRoller
source: html/75e1056d-07de-cfe4-6bb3-5a549bcbbe69.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolRoller Property

The id of the FamilySymbol to represent a roller boundary condition.

## Syntax (C#)
```csharp
public ElementId BoundaryConditionFamilySymbolRoller { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null